---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationPart..::..CreateHanger Method
FabricationPart Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateHanger(Document, FabricationServiceButton, Int32, ElementId) | Creates a free placed hanger. |
|  | CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean) | Creates a hanger on the fabrication part. |
|  | CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean) | Creates a hanger on the fabrication part. |

# See Also

FabricationPart Class

FabricationPart Members

Autodesk.Revit.DB Namespace